# CanAddBarGeometry Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarCurvesData..::..CanAddBarGeometry Method
RebarCurvesData Class See Also
---
If the layout rule is Singe or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.
If the layout rule is MaximumSpacing or MinimumClearSpacing this function will return always true.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool CanAddBarGeometry()
```

Visual Basic
---
```text
Public Function CanAddBarGeometry As Boolean
```

Visual C++
---
```text
public:
bool CanAddBarGeometry()
```

# ### Return Value
Returns true if we can add more bar geometry for the current layout, false otherwise.
# See Also
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace